[
  {
    "id": 1,
    "title": "Form Recruitment",
    "description": "A project for HMTI Udinus to streamline the member recruitment process using an efficient online registration system built with PHP and MySQL.",
    "image": "/images/project1.webp",
    "technologies": ["PHP", "MySQL", "HTML", "CSS"],
    "liveLink": "#",
    "repoLink": "https://github.com/Akazelll/FormRecruitment"
  },
  {
    "id": 2,
    "title": "DigiPustaka",
    "description": "A modern web application to manage a digital library's operations, including book and publisher management, and loan tracking.",
    "image": "/images/project2.png",
    "technologies": ["Laravel 11", "Tailwind CSS", "MySQL"],
    "liveLink": "#",
    "repoLink": "https://github.com/Akazelll/DigitalLibrary"
  },
  {
    "id": 3,
    "title": "Portfolio Digital",
    "description": "Project Portfolio with Next.js, TypeScript, and Tailwind CSS.",
    "image": "/images/projects3.png",
    "technologies": ["React", "Node.js", "TypeScript"],
    "liveLink": "https://portfolio-five-pink-33.vercel.app/",
    "repoLink": "#"
  },
  {
    "id": 4,
    "title": "Kostify",
    "description": "Kostify is a web-based application designed to streamline the management of boarding houses, locally known as 'kos,' offering a comprehensive solution for property managers to efficiently handle rooms, tenants, and billing. This modern tool, built with Laravel, provides a user-friendly interface for tracking room availability, managing tenant information, and automating the billing process. The central dashboard offers an at-a-glance overview of key statistics, such as room occupancy and outstanding payments, enabling property owners to modernize their operations and stay informed about the state of their business.",
    "image": "/images/project4.png",
    "technologies": ["Laravel", "ShadCN UI", "Tailwind CSS", "MySQL"],
    "liveLink": "#",
    "repoLink": "https://github.com/Akazelll/Kostify"
  },
  {
    "id": 5,
    "title": "Agri-Smart",
    "description": "AgriSmart dikembangkan sebagai solusi Smart Farming untuk meningkatkan produktivitas petani padi. Aplikasi ini mengimplementasikan model Deep Learning (EfficientNet) yang di-deploy menggunakan Python (Flask) untuk mengklasifikasi jenis penyakit daun padi seperti Leaf Blast, Brown Spot, dan Leaf Smut dengan akurasi tinggi.\n\nSisi antarmuka dibangun menggunakan Next.js 15 untuk performa yang cepat dan responsif, terintegrasi dengan Supabase sebagai backend-as-a-service untuk autentikasi pengguna, penyimpanan riwayat diagnosa, dan manajemen data keuangan secara real-time.",
    "image": "/images/project5.png",
    "technologies": ["React", "Node.js", "NextJS", "Supabase","ShadCN UI","Python","EfficientNet"],
    "liveLink": "https://www.agri-smart.biz.id/",
    "repoLink": "https://github.com/Akazelll/AgriSmart"
  }
]